#!/bin/zsh
#
# .zsh_plugins.txt - Antidote plugins file
#

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Completion styles
mattmc3/zephyr path:plugins/compstyle post:compstyle_zephyr_setup

# Keybindings / editor behavior
mattmc3/zephyr path:plugins/editor

# Fuzzy completion UI
# Requires the external `fzf` command.
aloxaf/fzf-tab

# History
mattmc3/zephyr path:plugins/history

# Utilities
mattmc3/zephyr path:plugins/utility
z-shell/zsh-eza conditional:has-eza
Junker/zsh-archlinux conditional:is-arch
zshzoo/macos conditional:is-macos
romkatv/zsh-bench kind:path
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/sudo

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
